<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- DW6 -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Warbot</title>
<link rel="stylesheet" href="warbot.css" type="text/css">
</head>
<body> 
<div id="masthead"> 
  <div id="title">
    <table width="934" >
      <tr>
        <th width="271" scope="col"><a href="http://www.warbot.org"><img src="images/warbot_logo1.jpg" width="229" height="117" border="0"></a></th>
        <th width="545" scope="col"><h1><b>Le site officiel de Warbot : <br>
        la guerre des robots </b></h1></th>
        <th width="133" scope="col"><img src="images/robot21.gif" width="64" height="64"></th>
      </tr>
    </table>
    
  <h1 id="siteName">&nbsp;</h1>
  </div>
  
  <div id="globalNav"> 
    <a href="warbot_regles.html">R&egrave;gles du jeu </a> <!-- | <a href="#">Tournois</a>  | <a href="http://www.lirmm.fr/sma/forumadkit/index.php?c=6">Forum</a> | <a href="download.html">Download</a> --> | 
	<a href="tutoriel/index.html">Tutoriel</a> <!-- | <a href="#">Autres usages </a> | <a href="#">English</a>  -->
  </div> 
</div> 
<div id="navBar"> 
  <div id="sectionLinks"> 
    <h3>Sections</h3> 
    <ul> 
      <li><a href="warbot_regles.html">R&egrave;gles du jeu </a></li> 
      <!-- <li><a href="#">Equipes pr&eacute;c&eacute;dentes </a></li> -->
      <li><a href="http://www.lirmm.fr/sma/forumadkit/index.php?c=6">Forum</a></li> 
      <li><a href="tutoriel/index.html">Tutoriel</a></li> 
      <!-- <li><a href="#">Autres usages </a></li> -->
    </ul> 
  </div> 
  <div class="relatedLinks"> 
    <h3>Liens</h3> 
    <ul> 
      <li><a href="http://www.madkit.org">MadKit</a></li> 
    </ul> 
    <p><strong>Note</strong>: <em>We are sorry but most of this site (except the tutorial) is still in french. It will be in both french and english very soon. </em></p>
  </div>
</div> 
<!--end navBar div --> 
<div id="headlines"> 
  <h3>Nouvelles</h3> 
    <p>
   <strong>Environnement de d&eacute;veloppement  - 3/04/2005 </strong><a href="#"><br>
   Un environnement de d&eacute;veloppement int&eacute;gr&eacute; de Warbot, con&ccedil;u par des &eacute;tudiants de Master de l'Universit&eacute; de Montpellier II, va bient&ocirc;t voir le jour.</a> .
  </p> 
  <p><strong>Le site Warbot.org - 31/03/2005 </strong><br>
  <a href="#">Le site de Warbot en fran&ccedil;ais est maintenant lanc&eacute;</a>. . </p>
</div> 
<!--end headlines --> 
<div id="content"> 
  <div class="feature"> 
    <a href="images/warbot_action.png"><img src="images/warbot_action.png" alt="" width="250" height="250" border="0"></a> 
    <h2>Pr&eacute;sentation</h2> 
    <p>Warbot est &agrave; la fois un jeu et une plate-forme d'&eacute;valuation et d'analyse de techniques de coordination entre agents, dans une situation de comp&eacute;tition o&ugrave; deux &eacute;quipes de "robots" s'affrontent pour tuer la base de l'adversaire.</p>
    <p>Dans ce projet, les joueurs sont en fait les d&eacute;veloppeurs des agents. Mais ils ne doivent faire qu'une seul chose: d&eacute;velopper les "cerveaux" (brain) de ces robots sachant que les "corps" (body) sont d&eacute;finis une fois pour toutes par les r&egrave;gles du jeu. De ce fait, la comp&eacute;tition r&eacute;side dans la qualit&eacute; de la programmation de ces cerveaux, et dans les strat&eacute;gies de coordination propos&eacute;es...</p>
  </div> 
  <div class="story"> 
    <h2>Histoire et enjeux</h2> 
    <p>L'&eacute;tude de la coop&eacute;ration entre agents constitue l'un des aspects les plus importants des syst&egrave;mes multi-agents. Mais les situations de conflits ou plus exactement de comp&eacute;tition sont au moins aussi importantes que les situations de coop&eacute;rations.De nombreux exemples ont &eacute;t&eacute; propos&eacute;s dans l'histoire des syst&egrave;mes multi-agent pour aider &agrave; comprendre et &agrave; &eacute;tudier ces situations: poursuites "&nbsp;proies-pr&eacute;dateurs&nbsp;", recherche d'&eacute;chantillons, agence de voyage, robots footballeurs, etc. sont des exemples de telles situations. </p>
    <p>Warbot constitue un environnement de tests de techniques de coordination entre agents dans un contexte similaire &agrave; celui des jeux video, dans lequel deux arm&eacute;es de robots s'affrontent. Le but d'une &eacute;quipe est de d&eacute;truire les bases du camp adverse avant que l'autre ne le fasse... Un peu bourrin, mais assez simple finalement &agrave; comprendre... </p>
    <p>Pour l'instant il existe 3 types de robots ayant des capacit&eacute;s diverses:</p>
    <ul>
      <li>Les robots &quot;lanceurs de missiles&quot;, savent tirer sur un adversaire, mais leur rayon de perception, ainsi que leur vitesse est relativement faible.</li>
      <li>Les robots &quot;explorateurs&quot; sont plus rapides, et leur rayon de perception est assez grand.</li>
      <li>Les robots &quot;base&quot; ne bougent pas, mais ils ont un rayon de perception &eacute;lev&eacute;. De plus, ils peuvent convertir la nourriture qu'ils re&ccedil;oivent en nouveaux robots!! </li>
    </ul>
    <p>La particularit&eacute; de Warbot vient de ce que les corps des robots ne peuvent pas (et ne doivent pas)  &ecirc;tre modifi&eacute;s par les joueurs, lesquels n'ont qu'une possibilit&eacute;: d&eacute;finir le comportement des robots de mani&egrave;re &agrave; ce qu'ils coop&egrave;rent entre eux.</p>
    <p>Il existe une grande diff&eacute;rence entre Warbot et un jeu vid&eacute;o: dans Warbot, lorsque un match est lanc&eacute;, les &ecirc;tres humains n'ont pas le droit d'intervenir dans le d&eacute;roulement du match, &agrave; la diff&eacute;rence des jeux video o&ugrave; les joueurs peuvent manipuler les entit&eacute;s avec la souris ou le clavier.</p>
    <p>Le projet Warbot a d&eacute;but&eacute; en 2001 sur une id&eacute;e de Jacques Ferber. La plate-forme a &eacute;t&eacute; r&eacute;alis&eacute;e par Fabien Michel et Jacques Ferber. Plusieurs tournois ont eu lieu, un par ann&eacute;e en 2002, 2003, 2004 et 2005 dans le cadre du DEA de Montpellier. Les comportements des &eacute;quipes des ann&eacute;es 2002 &agrave; 2004 sont distribu&eacute;s avec MadKit. Les &eacute;quipes 2005 et suivantes seront fournies sur ce site.. </p>
    <p>&nbsp;</p>
  </div>  
</div> 
<!--end content --> 
<div id="siteInfo"> 
  <!-- <img src="" width="44" height="22"> <a href="#">About Us</a> | <a href="#">Site
  Map</a> | <a href="#">Privacy Policy</a> | <a href="#">Contact Us</a> | --> &copy;2001-2005
  MadKit Team </div> 
<br> 
</body>
</html>
